package com.meiliwan.emall.antispam.filter;

import java.util.HashMap;

/**
 * 文本过滤
 * @author wyj
 *
 */
public class TextFilter {
    
    private static TextFilter textFilter = new TextFilter();
	//标准映射
	public HashMap<Character, Integer> standardMappingTable = new HashMap<Character, Integer>();
	//繁体字库
	String traditionalChars = "娿餀呃婑銰嬡鮟唵洝昻獓仸謸襖妑朳妑仈妑菝柭妑覇妑皛咟擺敗湃癍癍瘢頒闆蝂汾絆柈柈刅綁幇徬嫎垹蜯嫎徬菢笣剝湺怉寶砲蕔懪嚗柸蕜萆苝輩揹赑俻備渀夲苯镚嘣逬腷嬶仳啚毣幣滭斃閉獙怭澼鐴笾揙貶碥楩變辧辮辮猵摽滮鏢錶莂癟璸濱娦栤窉眪疒並箥譒妭菠訤峬誧卟芣鈽荹蔀攃財財財棌棌埰婇爘傪蛬殘慙參芲仺獊蔵懆鐰蓸愺厠憡側冊恻層竲揷紁嗏楂楂镲槎枈傪镵瀍浐闡顫誯畼甞瑺萇廠晿趫莏鈔謿謿謿漅訬車徹沏瞮烥宸曟冗陳撐稱峸荿珵塖珵懲僜諴浧阣歭肔呎肔肔恥歯呎哧趐茺沖蟲漴寵菗絒帱帱婤僽薵皗忸溴炪廚廚鋤雛蒢篨椘绌處遄巛瑏伝遄賗囱闖創欥腄腄箠舂錞脣錞蒓戥焯垐濨辭濨詞泚剌賜佽茐茐苁苁齰娖凗慛慛濢濢濢籿洊籿髊措溚垯荅咑汏槑瀻帶笩曃泹冄啴狚狚泹惔疍當澢黨蕩澢叨搗稲箌島菿稲檤盜徳嘚哋簦燈憕簦郰諟彽嘀廸敵廸疧哋渧苐渧弚點敟電扂淍汈鵰蜩鋽铞銱蜩瓞嗲渫渫媟疉玎饤汀町嵿萣忊丟崬笗蓳慬憅崬岽狪兠鬦乧跿荳浢哣嘟毐渎獨渎陼帾荰喥喥鍴葮葮斷葮碓兌隊怼沌壿頓沌哆奪躱朶媠憜睋睋皒皒悪苊皒慁洏ル洱尒聶②潑藅浌疺琺汎畨飜瀿汎煩笵氾粄疺汸淓汸汸汸汸汸倣婔悱飛萉厞腓廢曊棼玢汾妢墳帉奮妢濆仹崶猦峯峯颩瘋漨溤漨唪鳯仏娝玞膚荴諨苻茯棴捊湢椨釡椨諨賦復苻萯冨胕嗄姟妀漑鈣葢漑迀苷芉迀憾噉罓碙鋼矼釭罁罓釭禞滈餻溔鎬鎬鎬哠滒戨擱剨愅噶咯個茖艮茛畊浭菮笁糼糼塨栱匑厷営弖珙貢珙溝芶芶豞媾媾夠诂钴箛菇鼔咕嗗唂骰诂顧凅剮呱剮啩啩枴菅関菅蒄觀涫菅潅遦潅遦洸広迋規歸亀閨匦媿詭蓕匱蛫貴蔉輥煱漷國淉過铪陔嗨嗐韓浛凾凾諴癷猂猂汙漢忼濠恏秏呺滘哬曷嗬劾秝啝哬匼盉菏哿潶嫼佷哏悢涥悙橫蘅恆轟晎渱鴻葓宖宖葒糇糇糇犼糇後苸苸唿壺煳箶箶煳煳唬戶沍戶戶埖蕐澕磆磆畵劃囮話佪懷准壞歡寰還緩換漶喚抝巟巟曂瑝瑝瑝瑝愰縨巟洃媈媈幑冋毇珻珻浍匯浍涽殙渾婫萿钬焱镬戓靃貨禍樭僟積噭鶏咭潗彶喼旣哜凢悸哜計汜旣漈汜夾傢咖曱徦糘價泇駕糘姧盬堅簡凲奷撿撿彅倹彅諴薦濺見楗揵劍踺壃葁將槳茳彊蔣奨講醬夅潐烄茭嬌嬌腳烄儌烄嘋珓嘂帹湝兯莖聙瞐鯨倞驚棈經丼檠憬頸靜璄擏傹徑獍競凈泂僒啾糾玖勼氿慦舊僦咎佝劇匊挶怇舉藂岠琚姖倶岠涺倶呴岠涺涓鵑涓惓捲涓瘚決崛崛嚼傑啑結悈鎅徣夰屆凧荕釿唫妗珒噤緊婂僅殣琎晉噤菦锓浕勁荊覺吷吷蕝汮箘呁軍焄浚浚浚浚鉲閞揩剀刋歃嫝嵻嵻摃忼囥忼栲洘栲岢錁溘錁萪涜嗑妸渇尅尅愙錁肻肻恳垦妔妔涳芤啌摳囗釦簆喖崫楛厙褲洿赽赽寬窾筺誑纩洭纩況扝窺喹潰隗潰堒崐涃涃葀拡霩闊柆菈臘臘菈唻攋藍漤孄藍蘭瀾灠灠攋灠灡嚂哴蓈哴蓢蓢蓢烺崂崂窂荖粩絡絡崂嘞泺檑檑檑藞蔂檑叻類汨唥悡蓠婯疠呖悡唎竝劦唡聅嗹涟憐潋臉嗹戀煉煉悢涼樑悢倆唡糧涼煷涼嫽窷獠療獠孒漻烮煭烮挘獵啉啉潾臨鄰潾啉賃悋柃玪夌蕶齡玪玪夌靈夌玪領叧泠媹媹畱嚠媹蓅栁陸瀧聾茏茏湰泷泷茏溇溇嵝溇屚廬盧廬爐噜蕗蕗蔍淥陸馿焒焒佀膂屢慮侓卛慮淥欒孌孿亂稤畧囵囵囵囵囵囉囉羅囉儸詻詻絡媽嫲犸犸犸骉罵嫲嬤荬麥賣邁霡慲獌蠻慲嫚嫚嫚嫚笀汒吂杧漭貓罞毝罞茆萺萺邈貿庅坆烸苺湈莈葿烸羙妺閄悶們萠懞擝掹夢掹侎洣洣洣滵滵婂婂凂媔媌媌媌邈仯緲庿仯篾搣姄勄閩眀嘄佲洺掵繆嗼嚤嗼嗼嚤嚤嚤沬沬嗼嚜沬嗼帞湈哞湈畝毋募募朩朩嗱妠妠哪哪妠釢艿恧柰遖莮難灢撓悩悩閙迡浽禸嫰淣狔胒抳沵嫟膩屰秥姩淰茑杘涅嗫糵嗫苧犇沑妞狃哝哝哝挵伮怓伮囡煖疟穤穤喏呃瓯瓯瓯耦嘔耦汃瓟啪啪啪棑簰棑哌襻瀋盤昐溿叛判厐臱眫拋垉铇垉垉垉垉怌掊婄婄蓜姵濆湓泙憉莑堋萠鵬唪湴噼纰怶噼裨怶苉庇萹媥爿騙彯慓嘌潎潎拚頻貧闆娉岼泙泙岼憑甁屛岥秡櫇嘙岥廹圤舗圤匍箁逋圤鐠鑤剘剘嘁悽⑦娸諆渏忮斉騏豈阣佱晵噐氣棄淇拤撁鉛芉簽嗛墘錢湔濳淺芡嗛熗濸嫱嫱強熗毃佾喬趭喬喬毳趬佾竅苆苆苴愜苆埐儭蓁噖懄檎噙寑圊輕傾凊啨凊頃埥窮偢坵浗浗媨岖浀軀駆掫婜厾圜權葲洤吠勧蒛卻確峮羣嘫嘫姌媣孃讓隢擾隢慹芢亾涊姙認刄ㄖ嫆瀜嫆嫆嫆絨渘渘禸筎濡洳媷肗叺軟朊惢銳潤潤婼弜潵灑蕯噻噻彡傘潵鎟鎟喪騒掃溲脃澀潹莏唦摋閷乷倽繺篩曬姍屾剼釤閁陝僐訕傓傷啇賞仩尙哨哨哨燒汋仯卲袑虵舙舎摂渉涻蔎妽訷裑堔訷鉮瀋谉嬸卙腎椮殸泩狌圱繩渻墭乗夝聖溮妷浉湤濕詩迉拾坧湁溡喰實識屍馶鉽沶仕迣枾倳迣勢湜飾巿厔視鉽荍掱渞垨壽涭辤痩獣姝杼瀭埱忬蔋書孰濐癙屬朮沭樹娕竪薮唰缞帥拴灀叒摤誰渁腄挩橓順橓説碩爍凘凘凘偲俬呞噝屍峙④姒菘聳頌鎹浨誦溲蘇嫊趚愬蹜訴歗祘匴陏隨浽誶嵗嬘孫損逡逡縮鎖鎍鎻葰禢彵咜咜嗒沓孡珆溙忲忲呔貪墵憛談钽湠嘆湠饧溏漟橖瑭溏匋濤瑫匋洮洮匋匋討駦駦庝珶諟趧渧渧軆櫕珶珶屟兲婖瑱甶甛婖睓狣條朓萜鉄萜廰厛侹渟渟侹侹嗵秱哃恫浵僮硧硧茼統痌偸頭禿湥圖徙蒤凃廜汢汢兎團蓷蹆蹆蹆昋柂仛脫袉拕駞袉鋖沰哇哇咓襪迯塆塆琓汍唍涴梚脕啘萭忹迋匄忹蛧暀忹朢莣媙蘶嶶佹違圍惟潙惟崣逶偉沩屗沬墛菋嵔媦嵔蘶莅媦墛墛衞溫螡妏聞鈫沕穏問滃暡窩煱窉莪臥楃莁嗚烏汚莁偓嘸蕪圄呉娬伍圄吘橆⑤霚粅匢務圄誤厝凞唽覀扱唶犠浠唏汐厝渓習禧冼係戱細磍葭轄叚浹浹浹芐嗄圷锨姺佡鮮汘賢銜娴妶溓険哯獻縣陥羨陥線楿萫葙芗詳姠啍頙潒潒姠潒簘萷涍哓尒涍嚡拹挾峫脅喈冩悈啣澥绁瀉塮蕲俽厗噺杺暒睲睲瑆興鉶侀郉垳瑆圉莕悻狌兇兇洶熋咻俢饈溴琇莠歔濡歔歔湏俆汻溆旮垿胥緒續蓒媗媗嫙玆選妶絢敩泬膤洫勛揗洵咰浔紃廵咰卂訓卂遜卂壓呷鴉鴨吖吖厊厊蕥啞亞冴漹煙殗鹽嚴妍啱娫訁顔閻烾殗湮滟嬿厭熖匽験姎鴦昜婸咩樣陽卬癢養樣羕撽崾岆愮愮滛窰愮烑吆葯婹倻倻爺嘢竾頁鄴旪液①悘畩吚扆簃儀寲侇掎掎巳乁姒兿昜億洂嬑藙義谥譯異筃洇堷隂絪荶檭婬夤飮吚吲陻茚渶璎璎應瑩營迊盁颕哽眏喲砽砽滽澭怺怺悀怺湧鼡豳沋滺沋甴沋怞遊洧伖祐祐叒孧扜菸纡悇揄揄渔揄揄娯玙荢娪砡喐喁匬慾獄唷謍預鴛棩寃沅媴厡瑗圎園園羱緣逺夗蒝葾阮箹樾跞捳粵仴哾閱秐囩枃殒狁運藴暈韻夃咂卆酨酨災酨侢茬洎瓒暫瓒賍賍髒蹧蹧栆皁璪璪璪慥唣璪嫧萚荝澤賊熷璔嶒熷紥碴閘喳搾咋怍怍擿搾債秥跕斬蹍棧颭戰跕偡綻嶂張礃粀扙賬扙妱趙燳狣佋嗻菥悊鍺適淅沴嫃浈針浈忱沴桭鎮俥篜諍諍姃踭姃囸炡鄭姃芷汥伎汥倁倁汥汥と枳轵矗淔秇惪歮栺圵呮衹梽臸臸淛潪雉質菭狆筗妕蔠種妕偅衆洀淍詶詶皺咮咮咮蕏渚豩艸煑瞩炷炷莇茿炷炷柷跩抟磚啭賺圧裝妝獞匨匨搥墜綴痽浞炪婥棹恣粢恣稵橴ふ洎牸琮琮崈琮縂枞趉楱楱蒩娖蔟袓蒩蒩蒩鑽觜酔朂嶵澊噂葃咗莋莋唑蓙龍";
	//简体字库
	String simpleChars = "啊哎唉矮艾爱安俺按昂敖袄傲懊芭扒吧八巴拔跋把霸爸白百摆败拜斑班般颁板版扮拌伴半办邦帮榜膀绑棒磅傍胞包剥保饱宝抱报暴爆杯悲卑北辈背贝倍备奔本笨崩蹦迸逼鼻比鄙笔蔽毕毙闭敝必辟避边编贬扁便变辨辩辫遍标彪膘表别瘪滨宾兵冰柄丙病并玻播拨波驳捕哺补不布步部擦材才财睬踩彩菜餐参蚕残惭惨苍仓沧藏操糙曹草厕策侧册测层蹭插叉茶查碴察差柴掺馋缠产阐颤昌场尝常长厂唱超抄钞朝嘲潮巢吵车撤彻澈臣辰晨沉陈撑称城成呈乘程惩澄诚逞吃持池迟弛驰耻齿尺赤翅充冲虫崇宠抽酬畴踌稠愁筹绸丑臭出橱厨锄雏滁除楚础处揣川穿传喘串窗闯创吹捶锤垂春醇唇淳纯戳绰茨磁辞慈词此刺赐次葱匆从丛醋促摧崔催粹淬翠村存寸搓错搭达答打大呆戴带代逮担丹单胆旦但淡蛋当挡党荡档刀捣蹈倒岛到稻道盗德得的蹬灯登瞪邓堤低滴迪敌笛底地蒂第帝弟点典电店碉叼雕凋掉吊钓调跌爹碟蝶谍叠丁盯叮钉顶定订丢东冬董懂动栋冻洞兜抖斗陡豆逗痘都毒犊独读堵赌杜度渡端锻段断缎堆兑队对吨蹲顿钝多夺躲朵惰堕蛾峨俄娥恶厄饿恩而儿耳尔饵二发罚伐乏法帆番翻繁凡烦范犯饭泛坊芳方防仿访纺放菲非飞肥匪肺废费芬吩分纷坟粉奋份愤丰封枫峰锋风疯逢冯缝奉凤佛否夫肤扶幅符伏服浮福俯斧府副赋复付负富附嘎该改概钙盖溉干甘竿赶感敢冈刚钢缸肛纲岗杠篙高羔糕搞镐稿告哥歌搁割革葛格个各根跟耕更庚工攻功恭供躬公宫弓拱贡共钩勾沟狗构购够估沽孤姑鼓古骨谷股故顾固刮瓜剐挂褂拐棺关官冠观管馆罐惯灌贯光广逛规归龟闺轨鬼诡桂柜跪贵滚棍锅郭国果过哈孩海害韩含涵函喊罕旱焊汗汉杭豪好耗号浩呵喝荷核禾和何合盒河贺嘿黑很狠恨哼亨横衡恒轰哄虹鸿洪宏弘红喉侯猴吼候后呼乎忽壶葫胡蝴糊湖虎护互沪户花哗华猾滑画划化话徊怀淮坏欢环还缓换患唤幻荒慌黄皇凰惶煌晃幌谎灰挥辉徽回毁悔晦会汇绘昏婚浑混活伙火获或霍货祸基机积激鸡吉集及急即挤几季济计记既际纪夹家加甲假稼价架驾嫁歼监坚间兼奸检捡简俭剪减荐贱见键健剑建僵姜将浆江疆蒋奖讲酱降焦胶交骄娇脚狡缴绞教较叫接皆节茎睛晶鲸京惊精经井警景颈静境敬镜径竟竞净炯窘揪纠久九酒救旧就疚拘居菊局矩举聚拒据巨具距锯俱句炬剧捐鹃娟倦卷绢撅抉掘倔爵杰捷结戒界借介届巾筋斤金今津襟紧锦仅谨进晋禁近浸尽劲荆觉决诀绝均菌钧军君峻俊竣骏卡开楷凯刊砍康慷糠扛抗亢炕考拷烤苛棵磕颗科壳咳可渴克刻客课肯啃垦恳坑吭空孔控抠口扣寇枯窟苦库裤夸块快宽款筐狂矿眶旷况亏窥奎馈愧溃坤昆捆困括扩廓阔垃拉蜡腊啦来赖蓝婪栏篮兰澜揽览懒缆烂滥琅榔狼廊郎朗浪捞劳牢老姥酪烙涝勒乐雷镭蕾磊累擂肋类泪冷梨离丽厉历利例立力俩联莲连怜敛脸链恋炼练粮凉梁良两辆量晾亮谅撩聊僚疗燎了廖列裂烈劣猎琳林磷临邻鳞淋赁吝拎玲菱零龄铃羚凌灵陵岭领另令溜榴留刘瘤流柳六龙聋咙笼隆垄拢陇楼娄搂篓漏芦卢庐炉鲁露路鹿录陆驴吕铝侣旅屡虑律率滤绿峦挛孪乱掠略抡轮伦沦论萝罗逻锣箩洛骆络妈麻玛码蚂马骂嘛吗买麦卖迈脉瞒馒蛮满蔓曼慢漫芒茫盲忙莽猫茅毛矛卯冒帽貌贸么玫梅霉煤没眉每美妹门闷们萌蒙盟猛梦孟眯迷谜米蜜密棉绵免面苗描瞄藐秒渺庙妙蔑灭民敏闽明鸣铭名命谬摸蘑模膜磨摩魔抹末莫墨沫漠陌谋牟某亩母墓幕木目拿呐钠那娜纳乃奶耐奈南男难囊挠脑恼闹呢馁内嫩倪泥尼拟你匿腻逆拈年念鸟尿捏聂孽镊宁牛扭钮纽脓浓农弄奴努怒女暖虐懦糯诺哦欧鸥殴藕呕偶趴爬帕怕拍排牌徘派攀潘盘盼畔判叛庞旁胖抛咆刨炮袍跑泡呸培赔陪配佩喷盆砰彭蓬棚朋鹏捧碰霹批披劈脾皮匹屁篇偏片骗飘漂票撇瞥拼频贫品聘坪苹萍平凭瓶屏坡泼颇婆破迫扑铺仆葡菩埔朴谱瀑期欺戚妻七其棋奇歧齐骑岂乞企启器气弃泣掐牵铅千签谦乾钱前潜浅欠歉枪呛墙蔷强抢敲悄桥瞧乔侨撬翘俏窍切茄且怯窃侵亲秦琴勤擒禽寝青轻倾清晴情顷请穷秋丘球求酋区曲躯驱取娶去圈权泉全犬劝缺却确裙群然燃冉染嚷让饶扰绕热仁人忍任认刃日蓉融熔溶容绒揉柔肉茹儒如辱汝入软阮蕊锐闰润若弱撒洒萨塞赛三伞散桑嗓丧骚扫嫂色涩森莎砂杀刹沙啥煞筛晒珊山删衫闪陕善汕扇伤商赏上尚梢捎稍烧勺少邵绍蛇舌舍摄涉社设申伸身深绅神沈审婶甚肾渗声生牲升绳省盛剩胜圣师失狮施湿诗尸十石拾时食实识屎驶式示士世柿事逝势是饰市室视试收手首守寿授受瘦兽殊抒输叔舒淑书熟暑鼠属术述树束竖数刷衰帅栓霜双爽谁水睡税瞬顺舜说硕烁斯撕嘶思私司丝死寺四似松耸颂送宋诵搜苏素速塑宿诉肃蒜算隋随绥碎岁遂孙损梭唆缩琐索锁所塌他它她塔踏抬台泰太态汰贪坛潭谈坦碳叹炭汤塘堂棠唐糖掏涛滔萄桃逃淘陶讨藤腾疼梯提题蹄啼体替涕剃屉天添填田甜舔腆挑条跳贴铁帖厅听廷停亭庭挺通桐同铜彤童桶捅筒统痛偷头秃突图徒途涂屠土吐兔团推腿褪退吞拖托脱鸵陀驮驼妥拓洼娃瓦袜外弯湾玩丸完碗挽晚婉万汪王亡枉网往旺望忘威巍微危违围唯为维萎委伟伪尾未蔚味畏胃喂魏位谓尉慰卫温蚊文闻纹吻稳问嗡翁蜗涡窝我卧握巫呜乌污诬屋无芜吾吴武五捂午舞伍雾物勿务悟误昔熙析西吸锡牺稀希夕惜溪习喜洗系戏细瞎霞辖暇峡侠狭下夏吓掀先仙鲜纤贤衔闲弦嫌险现献县馅羡陷线相香箱乡详响享项橡像向象萧削哮晓小孝鞋协挟邪胁谐写械卸懈泄泻谢薪欣辛新心星腥猩惺兴刑型邢行醒幸杏性姓兄凶胸熊休修羞嗅锈秀墟需虚嘘须徐许叙旭序婿绪续轩喧宣旋玄选眩绚学穴雪血勋循旬询寻驯巡殉汛训讯逊迅压押鸦鸭呀丫芽牙雅哑亚讶焉烟淹盐严研岩延言颜阎炎掩演艳燕厌焰宴验央鸯杨扬羊洋阳仰痒养样漾邀腰妖瑶摇遥窑谣姚咬药要椰耶爷野也页业叶夜一医依伊衣移仪疑姨椅倚已乙以艺易亿亦意毅义益译异茵因音阴姻吟银淫寅饮尹引隐印英樱婴应莹营迎盈颖硬映哟拥佣庸雍咏泳涌永勇用幽优悠忧由犹油游有友右佑又幼迂淤于余俞逾鱼愉渝娱与宇语玉郁遇愈欲狱育誉预鸳渊冤元袁原援园员圆源缘远苑愿怨院约越跃岳粤月悦阅耘云匀陨允运蕴晕韵孕砸杂栽哉灾载再在咱攒暂赞赃脏葬遭糟枣早澡躁噪造皂燥责择则泽贼增憎曾赠扎渣闸眨榨乍炸诈摘窄债粘沾斩展栈占战站湛绽章张掌杖丈帐仗招赵照兆召遮折哲者这浙珍真贞针侦枕诊振镇阵蒸挣睁征争怔正政郑证芝枝支吱蜘知肢汁之织职直植执值址指止只纸志至致制智稚质治中忠钟终种肿重众舟周州洲皱珠蛛朱猪诸逐竹煮嘱主柱助筑住注祝拽专砖转赚庄装妆撞壮状追坠缀准捉拙卓桌咨资姿滋紫子自字棕踪宗综总纵走奏揍租足族祖诅阻组钻嘴醉最罪尊遵昨左做作坐座龙";
	//全角状态的字符集
	String fullyFormedChars = "～！＠＃＄％＾＆＊（）＿＋｀１２３４５６７８９０－＝。，,．：；＂＇＜＞？／＼ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ";
	//半角角状态的字符集
	String halfFormedChars = "~!@#$%^&*()_+`1234567890-=....:;\"'<>?/\\abcdefghijklmnopqrstuvwxyzabcdefghijklmnopqrstuvwxyz";
	
	private TextFilter(){
		addStandardMappingTable();
	};

	public static synchronized TextFilter getInstance(){
		return textFilter;
	}
	
	private void addStandardMappingTable() {
		for(int i = 0; i < simpleChars.length(); i++){
			char tChar = traditionalChars.charAt(i);
			int sChar = simpleChars.charAt(i);
			if(tChar == sChar){
				continue;
			}
			Character tCharacter = Character.valueOf(tChar);
			if(standardMappingTable.get(tCharacter) == null){
				standardMappingTable.put(tCharacter, Integer.valueOf(sChar));
			}
		}
		for(int i = 0; i < halfFormedChars.length(); i++){
			char fChar = fullyFormedChars.charAt(i);
			int hChar = halfFormedChars.charAt(i);
			if(fChar == hChar){
				continue;
			}
			Character fCharacter = Character.valueOf(fChar);
			if(standardMappingTable.get(fCharacter) == null){
				standardMappingTable.put(fCharacter, Integer.valueOf(hChar));
			}
		}
	}
	
	public static String compress(String content){
		content = content.replaceAll(" ", "");
		content = content.replaceAll("[\r\n\t]", "");
		content = content.replaceAll("<br>", "");
		content = content.replaceAll("&nbsp;", "");
		content = content.replaceAll("&amp;", "&");
		return content;
	}
	
	public String standardFilter(String content){
		if(content == null){
			return null;
		}
		content = content.replaceAll("&amp;", "&");	
		
		StringBuffer sb = new StringBuffer();
		
		char[] chars = content.toCharArray();
		for(int i = 0; i < chars.length; i++){
			Integer sChar = standardMappingTable.get(Character.valueOf(chars[i]));
			if(sChar != null){
				char simpleChar = (char)sChar.intValue();
				sb.append(simpleChar);
			}else{
				sb.append(chars[i]);
			}
		}
		return sb.toString();
	}
	
	public static String illegalCharFilter(String content){
		content = content.replaceAll("[\u0000-\u001f\u007f-\u00a0]", "");
		return content;
	}
	
}
